zephyrproject-rtos/hal_nxp/dts/nxp/mcx/mcxn/pinctrl/MCXN527VDF-pinctrl.h
/*
 * NOTE: Autogenerated file by gen_soc_headers.py
 * for MCXN527VDF/signal_configuration.xml
 *
 * 
 */

/*
 * Delta-deduplicated by dedup_pinctrl.py:
 * based on MCXN947VDF-pinctrl.h with this part's differences applied
 * below (182 removed, 0 changed,
 * 0 added). Regenerate with dedup_pinctrl.py;
 * do not edit by hand.
 * target-hash: 5c1d4a3d156c0945
 */

#ifndef _ZEPHYR_DTS_BINDING_MCXN527VDF_WRAPPER_
#define _ZEPHYR_DTS_BINDING_MCXN527VDF_WRAPPER_

#include "MCXN947VDF-pinctrl.h"

/* Signals not present on this part */
#undef CAN0_RXD_PIO1_11
#undef CAN0_RXD_PIO1_19
#undef CAN0_RXD_PIO1_3
#undef CAN0_RXD_PIO4_12
#undef CAN0_TXD_PIO1_10
#undef CAN0_TXD_PIO1_18
#undef CAN0_TXD_PIO1_2
#undef CAN0_TXD_PIO4_13
#undef CAN1_RXD_PIO1_12
#undef CAN1_RXD_PIO1_21
#undef CAN1_RXD_PIO1_7
#undef CAN1_RXD_PIO4_15
#undef CAN1_TXD_PIO1_13
#undef CAN1_TXD_PIO1_20
#undef CAN1_TXD_PIO1_6
#undef CAN1_TXD_PIO4_16
#undef ENET0_COL_PIO1_18
#undef ENET0_CRS_PIO1_19
#undef ENET0_MDC_PIO1_2
#undef ENET0_MDC_PIO1_20
#undef ENET0_MDIO_PIO1_21
#undef ENET0_MDIO_PIO1_3
#undef ENET0_RXD0_PIO1_14
#undef ENET0_RXD1_PIO1_15
#undef ENET0_RXD2_PIO1_16
#undef ENET0_RXD3_PIO1_17
#undef ENET0_RXDV_PIO1_13
#undef ENET0_RXER_PIO1_12
#undef ENET0_RX_CLK_PIO1_11
#undef ENET0_TXD0_PIO1_6
#undef ENET0_TXD1_PIO1_7
#undef ENET0_TXD2_PIO1_8
#undef ENET0_TXD3_PIO1_9
#undef ENET0_TXEN_PIO1_5
#undef ENET0_TXER_PIO1_10
#undef ENET0_TX_CLK_PIO1_4
#undef PDM0_CLK_PIO0_16
#undef PDM0_CLK_PIO0_4
#undef PDM0_DATA0_PIO0_17
#undef PDM0_DATA0_PIO0_5
#undef PDM0_DATA1_PIO0_18
#undef PDM0_DATA1_PIO0_6
#undef PWM0_A0_PIO3_0
#undef PWM0_A1_PIO3_6
#undef PWM0_A2_PIO3_8
#undef PWM0_A3_PIO3_10
#undef PWM0_B0_PIO3_1
#undef PWM0_B1_PIO3_7
#undef PWM0_B2_PIO3_9
#undef PWM0_B3_PIO3_11
#undef PWM0_X0_PIO3_2
#undef PWM0_X1_PIO3_3
#undef PWM0_X2_PIO3_4
#undef PWM0_X3_PIO3_5
#undef PWM1_A0_PIO2_6
#undef PWM1_A0_PIO3_12
#undef PWM1_A1_PIO2_4
#undef PWM1_A1_PIO3_14
#undef PWM1_A2_PIO2_2
#undef PWM1_A2_PIO3_16
#undef PWM1_A3_PIO2_0
#undef PWM1_A3_PIO3_20
#undef PWM1_B0_PIO2_7
#undef PWM1_B0_PIO3_13
#undef PWM1_B1_PIO2_5
#undef PWM1_B1_PIO3_15
#undef PWM1_B2_PIO2_3
#undef PWM1_B2_PIO3_17
#undef PWM1_B3_PIO2_1
#undef PWM1_B3_PIO3_21
#undef PWM1_X0_PIO2_8
#undef PWM1_X0_PIO3_18
#undef PWM1_X1_PIO2_9
#undef PWM1_X1_PIO3_19
#undef PWM1_X2_PIO2_10
#undef PWM1_X2_PIO3_22
#undef PWM1_X3_PIO2_11
#undef PWM1_X3_PIO3_23
#undef SAI0_MCLK_PIO1_30
#undef SAI0_MCLK_PIO3_7
#undef SAI0_RXD0_PIO2_3
#undef SAI0_RXD0_PIO3_11
#undef SAI0_RXD1_PIO1_5
#undef SAI0_RXD1_PIO2_4
#undef SAI0_RXD1_PIO3_12
#undef SAI0_RX_BCLK_PIO2_0
#undef SAI0_RX_BCLK_PIO3_14
#undef SAI0_RX_FS_PIO2_1
#undef SAI0_RX_FS_PIO3_15
#undef SAI0_TXD0_PIO2_2
#undef SAI0_TXD0_PIO3_10
#undef SAI0_TXD1_PIO1_4
#undef SAI0_TXD1_PIO2_5
#undef SAI0_TXD1_PIO3_13
#undef SAI0_TX_BCLK_PIO2_6
#undef SAI0_TX_BCLK_PIO3_8
#undef SAI0_TX_FS_PIO2_7
#undef SAI0_TX_FS_PIO3_9
#undef SAI1_MCLK_PIO1_21
#undef SAI1_MCLK_PIO3_6
#undef SAI1_RXD0_PIO1_3
#undef SAI1_RXD0_PIO2_9
#undef SAI1_RXD0_PIO3_21
#undef SAI1_RXD1_PIO2_10
#undef SAI1_RXD1_PIO3_22
#undef SAI1_RX_BCLK_PIO1_6
#undef SAI1_RX_BCLK_PIO3_18
#undef SAI1_RX_FS_PIO1_7
#undef SAI1_RX_FS_PIO3_19
#undef SAI1_TXD0_PIO1_2
#undef SAI1_TXD0_PIO2_8
#undef SAI1_TXD0_PIO3_20
#undef SAI1_TXD1_PIO2_11
#undef SAI1_TXD1_PIO3_23
#undef SAI1_TX_BCLK_PIO1_0
#undef SAI1_TX_BCLK_PIO3_16
#undef SAI1_TX_FS_PIO1_1
#undef SAI1_TX_FS_PIO3_17
#undef SIM0_CLK_PIO3_10
#undef SIM0_CLK_PIO3_16
#undef SIM0_IO_PIO3_11
#undef SIM0_IO_PIO3_17
#undef SIM0_PD_PIO3_20
#undef SIM0_PD_PIO3_8
#undef SIM0_RST_PIO3_21
#undef SIM0_RST_PIO3_9
#undef SIM0_VCCEN_PIO3_22
#undef SIM0_VCCEN_PIO3_7
#undef SIM1_CLK_PIO3_4
#undef SIM1_IO_PIO3_5
#undef SIM1_PD_PIO3_2
#undef SIM1_RST_PIO3_3
#undef SIM1_VCCEN_PIO3_6
#undef SINC0_MBIT0_PIO2_3
#undef SINC0_MBIT0_PIO4_13
#undef SINC0_MBIT1_PIO2_5
#undef SINC0_MBIT1_PIO4_17
#undef SINC0_MBIT2_PIO2_7
#undef SINC0_MBIT2_PIO4_21
#undef SINC0_MBIT3_PIO2_9
#undef SINC0_MBIT3_PIO4_2
#undef SINC0_MBIT4_PIO2_11
#undef SINC0_MBIT4_PIO4_5
#undef SINC0_MCLK0_PIO2_2
#undef SINC0_MCLK0_PIO4_12
#undef SINC0_MCLK1_PIO2_4
#undef SINC0_MCLK1_PIO4_16
#undef SINC0_MCLK2_PIO2_6
#undef SINC0_MCLK2_PIO4_20
#undef SINC0_MCLK3_PIO2_8
#undef SINC0_MCLK3_PIO4_0
#undef SINC0_MCLK4_PIO2_10
#undef SINC0_MCLK4_PIO4_4
#undef SINC0_MCLK_OUT0_PIO2_1
#undef SINC0_MCLK_OUT0_PIO4_15
#undef SINC0_MCLK_OUT1_PIO4_19
#undef SINC0_MCLK_OUT2_PIO4_23
#undef TSI0_CH0_PIO1_0
#undef TSI0_CH10_PIO0_6
#undef TSI0_CH11_PIO0_16
#undef TSI0_CH12_PIO0_17
#undef TSI0_CH13_PIO0_18
#undef TSI0_CH14_PIO0_19
#undef TSI0_CH15_PIO0_20
#undef TSI0_CH16_PIO0_21
#undef TSI0_CH17_PIO1_8
#undef TSI0_CH18_PIO1_9
#undef TSI0_CH19_PIO1_10
#undef TSI0_CH1_PIO1_1
#undef TSI0_CH20_PIO1_11
#undef TSI0_CH21_PIO1_12
#undef TSI0_CH22_PIO1_13
#undef TSI0_CH23_PIO1_14
#undef TSI0_CH24_PIO1_15
#undef TSI0_CH2_PIO1_2
#undef TSI0_CH3_PIO1_3
#undef TSI0_CH4_PIO1_4
#undef TSI0_CH5_PIO1_5
#undef TSI0_CH6_PIO1_6
#undef TSI0_CH7_PIO1_7
#undef TSI0_CH8_PIO0_4
#undef TSI0_CH9_PIO0_5

#endif /* _ZEPHYR_DTS_BINDING_MCXN527VDF_WRAPPER_ */
